Masmiseim36/nxpSDK/devices/MKV46F16/MKV46F16.h
/* XBARA - Peripheral instance base addresses */
/** Peripheral XBARA base address */
#define XBARA_BASE                               (0x40059000u)
/** Peripheral XBARA base pointer */
#define XBARA                                    ((XBARA_Type *)XBARA_BASE)
/** Array initializer of XBARA peripheral base addresses */
#define XBARA_BASE_ADDRS                         { XBARA_BASE }
/** Array initializer of XBARA peripheral base pointers */
#define XBARA_BASE_PTRS                          { XBARA }
/** Interrupt vectors for the XBARA peripheral type */
#define XBARA_IRQS                               { XBARA_IRQn }

/*!
 * @}
 */ /* end of group XBARA_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- XBARB Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup XBARB_Peripheral_Access_Layer XBARB Peripheral Access Layer
 * @{
 */

/** XBARB - Register Layout Typedef */
typedef struct {
  __IO uint16_t SEL0;                              /**< Crossbar B Select Register 0, offset: 0x0 */
  __IO uint16_t SEL1;                              /**< Crossbar B Select Register 1, offset: 0x2 */
  __IO uint16_t SEL2;                              /**< Crossbar B Select Register 2, offset: 0x4 */
  __IO uint16_t SEL3;                              /**< Crossbar B Select Register 3, offset: 0x6 */
  __IO uint16_t SEL4;                              /**< Crossbar B Select Register 4, offset: 0x8 */
  __IO uint16_t SEL5;                              /**< Crossbar B Select Register 5, offset: 0xA */
  __IO uint16_t SEL6;                              /**< Crossbar B Select Register 6, offset: 0xC */
  __IO uint16_t SEL7;                              /**< Crossbar B Select Register 7, offset: 0xE */
} XBARB_Type;

/* ----------------------------------------------------------------------------
   -- XBARB Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup XBARB_Register_Masks XBARB Register Masks
 * @{
 */

/*! @name SEL0 - Crossbar B Select Register 0 */
/*! @{ */
#define XBARB_SEL0_SEL0_MASK                     (0x1FU)
#define XBARB_SEL0_SEL0_SHIFT                    (0U)
/*! SEL0
 *  0b00000..CMP0 Output
 *  0b00001..CMP1 Output
 *  0b00010..CMP2 Output
 *  0b00011..CMP3 Output
 *  0b00100..FTM0 all channels match trigger ORed together
 *  0b00101..FTM0 counter init trigger
 *  0b00110..FTM3 all channels match trigger ORed together
 *  0b00111..FTM3 counter init trigger
 *  0b01000..PWMA channel 0 trigger 0 or trigger 1
 *  0b01001..PWMA channel 1 trigger 0 or trigger 1
 *  0b01010..PWMA channel 2 trigger 0 or trigger 1
 *  0b01011..PWMA channel 3 trigger 0 or trigger 1
 *  0b01100..PDB0 channel 0 output trigger
 *  0b01101..ADC converter A end of scan
 *  0b01110..XBARIN2 input pin
 *  0b01111..XBARIN3 input pin
 *  0b10000..FTM1 all channels match trigger ORed together
 *  0b10001..FTM1 counter init trigger
 *  0b10010..DMA channel 0 done
 *  0b10011..DMA channel 1 done
 *  0b10100..XBARIN10 input pin
 *  0b10101..XBARIN11 input pin
 *  0b10110..DMA channel 6 done
 *  0b10111..DMA channel 7 done
 *  0b11000..PIT trigger 0
 *  0b11001..PIT trigger 1
 *  0b11010..PDB1 channel 0 output trigger
 *  0b11011..ADC converter B end of scan
 */
#define XBARB_SEL0_SEL0(x)                       (((uint16_t)(((uint16_t)(x)) << XBARB_SEL0_SEL0_SHIFT)) & XBARB_SEL0_SEL0_MASK)
#define XBARB_SEL0_SEL1_MASK                     (0x1F00U)
#define XBARB_SEL0_SEL1_SHIFT                    (8U)
/*! SEL1
 *  0b00000..CMP0 Output
 *  0b00001..CMP1 Output
 *  0b00010..CMP2 Output
 *  0b00011..CMP3 Output
 *  0b00100..FTM0 all channels match trigger ORed together
 *  0b00101..FTM0 counter init trigger
 *  0b00110..FTM3 all channels match trigger ORed together
 *  0b00111..FTM3 counter init trigger
 *  0b01000..PWMA channel 0 trigger 0 or trigger 1
 *  0b01001..PWMA channel 1 trigger 0 or trigger 1
 *  0b01010..PWMA channel 2 trigger 0 or trigger 1
 *  0b01011..PWMA channel 3 trigger 0 or trigger 1
 *  0b01100..PDB0 channel 0 output trigger
 *  0b01101..ADC converter A end of scan
 *  0b01110..XBARIN2 input pin
 *  0b01111..XBARIN3 input pin
 *  0b10000..FTM1 all channels match trigger ORed together
 *  0b10001..FTM1 counter init trigger
 *  0b10010..DMA channel 0 done
 *  0b10011..DMA channel 1 done
 *  0b10100..XBARIN10 input pin
 *  0b10101..XBARIN11 input pin
 *  0b10110..DMA channel 6 done
 *  0b10111..DMA channel 7 done
 *  0b11000..PIT trigger 0
 *  0b11001..PIT trigger 1
 *  0b11010..PDB1 channel 0 output trigger
 *  0b11011..ADC converter B end of scan
 */
#define XBARB_SEL0_SEL1(x)                       (((uint16_t)(((uint16_t)(x)) << XBARB_SEL0_SEL1_SHIFT)) & XBARB_SEL0_SEL1_MASK)
/*! @} */

/*! @name SEL1 - Crossbar B Select Register 1 */
/*! @{ */
#define XBARB_SEL1_SEL2_MASK                     (0x1FU)
#define XBARB_SEL1_SEL2_SHIFT                    (0U)
/*! SEL2
 *  0b00000..CMP0 Output
 *  0b00001..CMP1 Output
 *  0b00010..CMP2 Output
 *  0b00011..CMP3 Output
 *  0b00100..FTM0 all channels match trigger ORed together
 *  0b00101..FTM0 counter init trigger
 *  0b00110..FTM3 all channels match trigger ORed together
 *  0b00111..FTM3 counter init trigger
 *  0b01000..PWMA channel 0 trigger 0 or trigger 1
 *  0b01001..PWMA channel 1 trigger 0 or trigger 1
 *  0b01010..PWMA channel 2 trigger 0 or trigger 1
 *  0b01011..PWMA channel 3 trigger 0 or trigger 1
 *  0b01100..PDB0 channel 0 output trigger
 *  0b01101..ADC converter A end of scan
 *  0b01110..XBARIN2 input pin
 *  0b01111..XBARIN3 input pin
 *  0b10000..FTM1 all channels match trigger ORed together
 *  0b10001..FTM1 counter init trigger
 *  0b10010..DMA channel 0 done
 *  0b10011..DMA channel 1 done
 *  0b10100..XBARIN10 input pin
 *  0b10101..XBARIN11 input pin
 *  0b10110..DMA channel 6 done
 *  0b10111..DMA channel 7 done
 *  0b11000..PIT trigger 0
 *  0b11001..PIT trigger 1
 *  0b11010..PDB1 channel 0 output trigger
 *  0b11011..ADC converter B end of scan
 */
#define XBARB_SEL1_SEL2(x)                       (((uint16_t)(((uint16_t)(x)) << XBARB_SEL1_SEL2_SHIFT)) & XBARB_SEL1_SEL2_MASK)
#define XBARB_SEL1_SEL3_MASK                     (0x1F00U)
#define XBARB_SEL1_SEL3_SHIFT                    (8U)
/*! SEL3
 *  0b00000..CMP0 Output
 *  0b00001..CMP1 Output
 *  0b00010..CMP2 Output
 *  0b00011..CMP3 Output
 *  0b00100..FTM0 all channels match trigger ORed together
 *  0b00101..FTM0 counter init trigger
 *  0b00110..FTM3 all channels match trigger ORed together
 *  0b00111..FTM3 counter init trigger
 *  0b01000..PWMA channel 0 trigger 0 or trigger 1
 *  0b01001..PWMA channel 1 trigger 0 or trigger 1
 *  0b01010..PWMA channel 2 trigger 0 or trigger 1
 *  0b01011..PWMA channel 3 trigger 0 or trigger 1
 *  0b01100..PDB0 channel 0 output trigger
 *  0b01101..ADC converter A end of scan
 *  0b01110..XBARIN2 input pin
 *  0b01111..XBARIN3 input pin
 *  0b10000..FTM1 all channels match trigger ORed together
 *  0b10001..FTM1 counter init trigger
 *  0b10010..DMA channel 0 done
 *  0b10011..DMA channel 1 done
 *  0b10100..XBARIN10 input pin
 *  0b10101..XBARIN11 input pin
 *  0b10110..DMA channel 6 done
 *  0b10111..DMA channel 7 done
 *  0b11000..PIT trigger 0
 *  0b11001..PIT trigger 1
 *  0b11010..PDB1 channel 0 output trigger
 *  0b11011..ADC converter B end of scan
 */
#define XBARB_SEL1_SEL3(x)                       (((uint16_t)(((uint16_t)(x)) << XBARB_SEL1_SEL3_SHIFT)) & XBARB_SEL1_SEL3_MASK)
/*! @} */

/*! @name SEL2 - Crossbar B Select Register 2 */
/*! @{ */
#define XBARB_SEL2_SEL4_MASK                     (0x1FU)
#define XBARB_SEL2_SEL4_SHIFT                    (0U)
/*! SEL4
 *  0b00000..CMP0 Output
 *  0b00001..CMP1 Output
 *  0b00010..CMP2 Output
 *  0b00011..CMP3 Output
 *  0b00100..FTM0 all channels match trigger ORed together
 *  0b00101..FTM0 counter init trigger
 *  0b00110..FTM3 all channels match trigger ORed together
 *  0b00111..FTM3 counter init trigger
 *  0b01000..PWMA channel 0 trigger 0 or trigger 1
 *  0b01001..PWMA channel 1 trigger 0 or trigger 1
 *  0b01010..PWMA channel 2 trigger 0 or trigger 1
 *  0b01011..PWMA channel 3 trigger 0 or trigger 1
 *  0b01100..PDB0 channel 0 output trigger
 *  0b01101..ADC converter A end of scan
 *  0b01110..XBARIN2 input pin
 *  0b01111..XBARIN3 input pin
 *  0b10000..FTM1 all channels match trigger ORed together
 *  0b10001..FTM1 counter init trigger
 *  0b10010..DMA channel 0 done
 *  0b10011..DMA channel 1 done
 *  0b10100..XBARIN10 input pin
 *  0b10101..XBARIN11 input pin
 *  0b10110..DMA channel 6 done
 *  0b10111..DMA channel 7 done
 *  0b11000..PIT trigger 0
 *  0b11001..PIT trigger 1
 *  0b11010..PDB1 channel 0 output trigger
 *  0b11011..ADC converter B end of scan
 */
#define XBARB_SEL2_SEL4(x)                       (((uint16_t)(((uint16_t)(x)) << XBARB_SEL2_SEL4_SHIFT)) & XBARB_SEL2_SEL4_MASK)
#define XBARB_SEL2_SEL5_MASK                     (0x1F00U)
#define XBARB_SEL2_SEL5_SHIFT                    (8U)
/*! SEL5
 *  0b00000..CMP0 Output
 *  0b00001..CMP1 Output
 *  0b00010..CMP2 Output
 *  0b00011..CMP3 Output
 *  0b00100..FTM0 all channels match trigger ORed together
 *  0b00101..FTM0 counter init trigger
 *  0b00110..FTM3 all channels match trigger ORed together
 *  0b00111..FTM3 counter init trigger
 *  0b01000..PWMA channel 0 trigger 0 or trigger 1
 *  0b01001..PWMA channel 1 trigger 0 or trigger 1
 *  0b01010..PWMA channel 2 trigger 0 or trigger 1
 *  0b01011..PWMA channel 3 trigger 0 or trigger 1
 *  0b01100..PDB0 channel 0 output trigger
 *  0b01101..ADC converter A end of scan
 *  0b01110..XBARIN2 input pin
 *  0b01111..XBARIN3 input pin
 *  0b10000..FTM1 all channels match trigger ORed together
 *  0b10001..FTM1 counter init trigger
 *  0b10010..DMA channel 0 done
 *  0b10011..DMA channel 1 done
 *  0b10100..XBARIN10 input pin
 *  0b10101..XBARIN11 input pin
 *  0b10110..DMA channel 6 done
 *  0b10111..DMA channel 7 done
 *  0b11000..PIT trigger 0
 *  0b11001..PIT trigger 1
 *  0b11010..PDB1 channel 0 output trigger
 *  0b11011..ADC converter B end of scan
 */
#define XBARB_SEL2_SEL5(x)                       (((uint16_t)(((uint16_t)(x)) << XBARB_SEL2_SEL5_SHIFT)) & XBARB_SEL2_SEL5_MASK)
/*! @} */

/*! @name SEL3 - Crossbar B Select Register 3 */
/*! @{ */
#define XBARB_SEL3_SEL6_MASK                     (0x1FU)
#define XBARB_SEL3_SEL6_SHIFT                    (0U)
/*! SEL6
 *  0b00000..CMP0 Output
 *  0b00001..CMP1 Output
 *  0b00010..CMP2 Output
 *  0b00011..CMP3 Output
 *  0b00100..FTM0 all channels match trigger ORed together
 *  0b00101..FTM0 counter init trigger
 *  0b00110..FTM3 all channels match trigger ORed together
 *  0b00111..FTM3 counter init trigger
 *  0b01000..PWMA channel 0 trigger 0 or trigger 1
 *  0b01001..PWMA channel 1 trigger 0 or trigger 1
 *  0b01010..PWMA channel 2 trigger 0 or trigger 1
 *  0b01011..PWMA channel 3 trigger 0 or trigger 1
 *  0b01100..PDB0 channel 0 output trigger
 *  0b01101..ADC converter A end of scan
 *  0b01110..XBARIN2 input pin
 *  0b01111..XBARIN3 input pin
 *  0b10000..FTM1 all channels match trigger ORed together
 *  0b10001..FTM1 counter init trigger
 *  0b10010..DMA channel 0 done
 *  0b10011..DMA channel 1 done
 *  0b10100..XBARIN10 input pin
 *  0b10101..XBARIN11 input pin
 *  0b10110..DMA channel 6 done
 *  0b10111..DMA channel 7 done
 *  0b11000..PIT trigger 0
 *  0b11001..PIT trigger 1
 *  0b11010..PDB1 channel 0 output trigger
 *  0b11011..ADC converter B end of scan
 */
#define XBARB_SEL3_SEL6(x)                       (((uint16_t)(((uint16_t)(x)) << XBARB_SEL3_SEL6_SHIFT)) & XBARB_SEL3_SEL6_MASK)
#define XBARB_SEL3_SEL7_MASK                     (0x1F00U)
#define XBARB_SEL3_SEL7_SHIFT                    (8U)
/*! SEL7
 *  0b00000..CMP0 Output
 *  0b00001..CMP1 Output
 *  0b00010..CMP2 Output
 *  0b00011..CMP3 Output
 *  0b00100..FTM0 all channels match trigger ORed together
 *  0b00101..FTM0 counter init trigger
 *  0b00110..FTM3 all channels match trigger ORed together
 *  0b00111..FTM3 counter init trigger
 *  0b01000..PWMA channel 0 trigger 0 or trigger 1
 *  0b01001..PWMA channel 1 trigger 0 or trigger 1
 *  0b01010..PWMA channel 2 trigger 0 or trigger 1
 *  0b01011..PWMA channel 3 trigger 0 or trigger 1
 *  0b01100..PDB0 channel 0 output trigger
 *  0b01101..ADC converter A end of scan
 *  0b01110..XBARIN2 input pin
 *  0b01111..XBARIN3 input pin
 *  0b10000..FTM1 all channels match trigger ORed together
 *  0b10001..FTM1 counter init trigger
 *  0b10010..DMA channel 0 done
 *  0b10011..DMA channel 1 done
 *  0b10100..XBARIN10 input pin
 *  0b10101..XBARIN11 input pin
 *  0b10110..DMA channel 6 done
 *  0b10111..DMA channel 7 done
 *  0b11000..PIT trigger 0
 *  0b11001..PIT trigger 1
 *  0b11010..PDB1 channel 0 output trigger
 *  0b11011..ADC converter B end of scan
 */
#define XBARB_SEL3_SEL7(x)                       (((uint16_t)(((uint16_t)(x)) << XBARB_SEL3_SEL7_SHIFT)) & XBARB_SEL3_SEL7_MASK)
/*! @} */

